librbd_iscsi/yujiang/randread/logs/fio-iscsi-1m.fio.log
lv0: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;326518784;544094;531;600114;24;2702;79.863694;44.700228;5548;373561;30026.785856;25624.704732;1.000000%=10027;5.000000%=12386;10.000000%=13828;20.000000%=15925;30.000000%=17956;40.000000%=19791;50.000000%=21889;60.000000%=24510;70.000000%=29491;80.000000%=36438;90.000000%=51118;95.000000%=79167;99.000000%=147849;99.500000%=166723;99.900000%=219152;99.950000%=240123;99.990000%=287309;0%=0;0%=0;0%=0;5613;373622;30107.174178;25625.484191;369948;741376;100.000000%;544100.929167;61422.349305;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.490240%;4.984220%;319043;0;12391;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.94%;40.58%;48.08%;7.02%;3.34%;0.04%;0.00%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=4149230: Thu May 21 17:58:43 2020
   read: IOPS=531, BW=531MiB/s (557MB/s)(311GiB/600114msec)
    slat (usec): min=24, max=2702, avg=79.86, stdev=44.70
    clat (msec): min=5, max=373, avg=30.03, stdev=25.62
     lat (msec): min=5, max=373, avg=30.11, stdev=25.63
    clat percentiles (msec):
     |  1.00th=[   11],  5.00th=[   13], 10.00th=[   14], 20.00th=[   16],
     | 30.00th=[   18], 40.00th=[   20], 50.00th=[   22], 60.00th=[   25],
     | 70.00th=[   30], 80.00th=[   37], 90.00th=[   52], 95.00th=[   80],
     | 99.00th=[  148], 99.50th=[  167], 99.90th=[  220], 99.95th=[  241],
     | 99.99th=[  288]
   bw (  KiB/s): min=369948, max=741376, per=100.00%, avg=544100.93, stdev=61422.35, samples=1200
   iops        : min=  361, max=  724, avg=531.31, stdev=59.97, samples=1200
  lat (msec)   : 10=0.94%, 20=40.58%, 50=48.08%, 100=7.02%, 250=3.34%
  lat (msec)   : 500=0.04%
  cpu          : usr=0.49%, sys=4.98%, ctx=319043, majf=0, minf=12391
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=318866,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=531MiB/s (557MB/s), 531MiB/s-531MiB/s (557MB/s-557MB/s), io=311GiB (334GB), run=600114-600114msec