librbd_iscsi/yujiang/randread/logs/fio-iscsi-4k.fio.log
lv0: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;16595744;27659;6914;600012;1;886;7.323696;5.757205;9;457136;2304.501053;3919.276148;1.000000%=505;5.000000%=577;10.000000%=626;20.000000%=684;30.000000%=733;40.000000%=782;50.000000%=831;60.000000%=897;70.000000%=1003;80.000000%=2605;90.000000%=7438;95.000000%=9895;99.000000%=16318;99.500000%=19529;99.900000%=33423;99.950000%=43253;99.990000%=64749;0%=0;0%=0;0%=0;335;457158;2312.050385;3919.418673;784;36224;100.000000%;27676.336667;6773.563188;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.448955%;7.782524%;3527302;0;34;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.01%;0.86%;32.89%;35.99%;9.26%;3.83%;12.44%;4.27%;0.43%;0.03%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=4120642: Thu May 21 17:18:40 2020
   read: IOPS=6914, BW=27.0MiB/s (28.3MB/s)(15.8GiB/600012msec)
    slat (nsec): min=1551, max=886989, avg=7323.70, stdev=5757.21
    clat (usec): min=9, max=457136, avg=2304.50, stdev=3919.28
     lat (usec): min=335, max=457158, avg=2312.05, stdev=3919.42
    clat percentiles (usec):
     |  1.00th=[  506],  5.00th=[  578], 10.00th=[  627], 20.00th=[  685],
     | 30.00th=[  734], 40.00th=[  783], 50.00th=[  832], 60.00th=[  898],
     | 70.00th=[ 1004], 80.00th=[ 2606], 90.00th=[ 7439], 95.00th=[ 9896],
     | 99.00th=[16319], 99.50th=[19530], 99.90th=[33424], 99.95th=[43254],
     | 99.99th=[64750]
   bw (  KiB/s): min=  784, max=36224, per=100.00%, avg=27676.34, stdev=6773.56, samples=1200
   iops        : min=  196, max= 9056, avg=6919.05, stdev=1693.38, samples=1200
  lat (usec)   : 10=0.01%, 250=0.01%, 500=0.86%, 750=32.89%, 1000=35.99%
  lat (msec)   : 2=9.26%, 4=3.83%, 10=12.44%, 20=4.27%, 50=0.43%
  lat (msec)   : 100=0.03%, 250=0.01%, 500=0.01%
  cpu          : usr=2.45%, sys=7.78%, ctx=3527302, majf=0, minf=34
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=4148936,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=27.0MiB/s (28.3MB/s), 27.0MiB/s-27.0MiB/s (28.3MB/s-28.3MB/s), io=15.8GiB (16.0GB), run=600012-600012msec