librbd_iscsi/yujiang/randread/logs/fio-iscsi-64k.fio.log
lv0: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;146360192;243923;3811;600024;2;975;10.626813;8.138000;172;586626;4185.229309;7264.645215;1.000000%=765;5.000000%=905;10.000000%=987;20.000000%=1089;30.000000%=1187;40.000000%=1286;50.000000%=1417;60.000000%=1597;70.000000%=1908;80.000000%=4947;90.000000%=11075;95.000000%=19267;99.000000%=35389;99.500000%=42205;99.900000%=59506;99.950000%=67633;99.990000%=94896;0%=0;0%=0;0%=0;448;586637;4196.077368;7264.790865;26496;318208;99.994939%;243910.655833;40347.146040;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.640937%;5.692615%;2148090;0;1878;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.79%;10.43%;60.47%;6.70%;9.81%;7.13%;4.44%;0.23%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=4135048: Thu May 21 17:38:42 2020
   read: IOPS=3811, BW=238MiB/s (250MB/s)(140GiB/600024msec)
    slat (usec): min=2, max=975, avg=10.63, stdev= 8.14
    clat (usec): min=172, max=586626, avg=4185.23, stdev=7264.65
     lat (usec): min=448, max=586637, avg=4196.08, stdev=7264.79
    clat percentiles (usec):
     |  1.00th=[  766],  5.00th=[  906], 10.00th=[  988], 20.00th=[ 1090],
     | 30.00th=[ 1188], 40.00th=[ 1287], 50.00th=[ 1418], 60.00th=[ 1598],
     | 70.00th=[ 1909], 80.00th=[ 4948], 90.00th=[11076], 95.00th=[19268],
     | 99.00th=[35390], 99.50th=[42206], 99.90th=[59507], 99.95th=[67634],
     | 99.99th=[94897]
   bw (  KiB/s): min=26496, max=318208, per=99.99%, avg=243910.66, stdev=40347.15, samples=1200
   iops        : min=  414, max= 4972, avg=3811.08, stdev=630.42, samples=1200
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.79%, 1000=10.43%
  lat (msec)   : 2=60.47%, 4=6.70%, 10=9.81%, 20=7.13%, 50=4.44%
  lat (msec)   : 100=0.23%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=1.64%, sys=5.69%, ctx=2148090, majf=0, minf=1878
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=2286878,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=238MiB/s (250MB/s), 238MiB/s-238MiB/s (250MB/s-250MB/s), io=140GiB (150GB), run=600024-600024msec