librbd_iscsi/yujiang/randread/logs/fio-iscsi-8k.fio.log
lv0: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;34762032;57935;7241;600015;1;548;7.253797;6.184412;185;355735;2200.004536;3721.818032;1.000000%=536;5.000000%=618;10.000000%=659;20.000000%=716;30.000000%=765;40.000000%=815;50.000000%=864;60.000000%=921;70.000000%=1003;80.000000%=1531;90.000000%=7045;95.000000%=9633;99.000000%=15794;99.500000%=18743;99.900000%=30015;99.950000%=38535;99.990000%=60555;0%=0;0%=0;0%=0;334;355741;2207.473795;3721.924779;3872;75200;99.994859%;57932.021667;12680.253617;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.509441%;7.903316%;3778266;0;15881;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.33%;26.04%;43.44%;11.00%;3.35%;11.49%;3.98%;0.36%;0.02%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=4128385: Thu May 21 17:28:41 2020
   read: IOPS=7241, BW=56.6MiB/s (59.3MB/s)(33.2GiB/600015msec)
    slat (nsec): min=1609, max=548601, avg=7253.80, stdev=6184.41
    clat (usec): min=185, max=355735, avg=2200.00, stdev=3721.82
     lat (usec): min=334, max=355741, avg=2207.47, stdev=3721.92
    clat percentiles (usec):
     |  1.00th=[  537],  5.00th=[  619], 10.00th=[  660], 20.00th=[  717],
     | 30.00th=[  766], 40.00th=[  816], 50.00th=[  865], 60.00th=[  922],
     | 70.00th=[ 1004], 80.00th=[ 1532], 90.00th=[ 7046], 95.00th=[ 9634],
     | 99.00th=[15795], 99.50th=[18744], 99.90th=[30016], 99.95th=[38536],
     | 99.99th=[60556]
   bw (  KiB/s): min= 3872, max=75200, per=99.99%, avg=57932.02, stdev=12680.25, samples=1200
   iops        : min=  484, max= 9400, avg=7241.49, stdev=1585.03, samples=1200
  lat (usec)   : 250=0.01%, 500=0.33%, 750=26.04%, 1000=43.44%
  lat (msec)   : 2=11.00%, 4=3.35%, 10=11.49%, 20=3.98%, 50=0.36%
  lat (msec)   : 100=0.02%, 250=0.01%, 500=0.01%
  cpu          : usr=2.51%, sys=7.90%, ctx=3778266, majf=0, minf=15881
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=4345254,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=56.6MiB/s (59.3MB/s), 56.6MiB/s-56.6MiB/s (59.3MB/s-59.3MB/s), io=33.2GiB (35.6GB), run=600015-600015msec